package TH12;

/*
 * Создать объект в котором храниться имя, фамилия и отчество. Дальше создать 2 массива с данными типа этого обекта (ФИО). В одном содержатся мужские ФИО, 
 * в другом женские. Заполнить их подходящими данными. Все массивы записать в HashMap с ключами "man",  "woman" соответсвенно. 
 * Дальше пользователь вводить мужское или женское ФИО он хочет вывести и в соответсвии с этим рандомно вытаскиваем значения из массива который хранится в HashMap. 
 * Т. е. на экран дожно вывести рандомное ФИО из массива.
 */

public class Task3 {
	
	// read tooltips!

	public static void main(String[] args) {
		Application2 frame = new Application2();
		frame.setVisible(true);
	}

}
