package TH12;

/*
 * Создать массив с данными типа String, с использованием наиболее подходящей коллекции. 
 * Заполнить его данными. Данные должны вводиться с консоли, массив может быть любой длинны. 
 * Ввод прекрашать по вводу спец. команды (придумать любой символ при вводе которого прекращаем заполнение массива). 
 * Далее читаем данные массива в цикле и удаляем из строк все буквы "а". Затем выводим получившийся массив.
 * 
 * Необходимо удалить дубликаты из массива предыдущего задания.
 */

public class Task1and2 {
	
	// read tooltips!
	
	public static void main(String[] args) {
		// run application
		Application frame = new Application();
		frame.setVisible(true);
	}
}
